{
  "backend/main.mo": "Empty Motoko actor with no defined methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind base and component layers defining OKLCH theme variables and dark mode overrides.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component managing game state, question flow, progression, and UI layout.",
  "frontend/src/components/AdPlaceholderBanner.tsx": "Simple bottom banner placeholder for future ads.",
  "frontend/src/components/GameHeader.tsx": "Header with logo, level badge, share button, and music toggle.",
  "frontend/src/components/LevelUpOverlay.tsx": "Dialog overlay showing level-up celebration with continue and share actions.",
  "frontend/src/components/ProgressBar.tsx": "Wrapper around UI progress bar displaying percent toward next level.",
  "frontend/src/components/QuestionCard.tsx": "Renders question text and answers with correct/wrong feedback and locking behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actor, refreshing on identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Hook managing looping background music playback and mute toggle.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identity state, and exposing login/clear helpers.",
  "frontend/src/hooks/useOpenTdbQuestion.ts": "Custom hook that fetches a trivia question from OpenTDB with retry logic and exposes loading state and a reload function.",
  "frontend/src/index.css": "Tailwind base configuration defining color variables, dark mode overrides, and global styles.",
  "frontend/src/lib/opentdb.ts": "Implements OpenTDB API integration including session token handling, question fetching, HTML decoding, and answer shuffling.",
  "frontend/src/lib/persistence.ts": "Handles loading and saving game progress to localStorage using a fixed storage key.",
  "frontend/src/lib/progression.ts": "Defines level progression logic, goal calculation, progress percentage, and applying answer results to update state.",
  "frontend/src/lib/share.ts": "Provides score-sharing via Web Share API with clipboard fallback and user notifications.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, radii, and enabling plugins.",
  "project_state.json": "Project metadata describing the trivia app’s purpose, architecture, image requirements, and implemented feature set."
}